### <center> Creating dataframes using different methods

In [1]:
import pandas as pd
import numpy as np

#### Finding Data Type

In [2]:
My_Series = pd.Series([12.4,36.8,78.5,95.3])
print(My_Series.dtype)

float64

#### Converting to List

In [3]:
print(My_Series.tolist())

[12.4, 36.8, 78.5, 95.3]

## Pandas Dataframe

#### A Pandas dataframe is a tabular data structure that stores in the form of rows and columns. As a standard,the rows correspond to records while columns refer to attributes. In simplified words, a Pandas dataframe is a collection of series.

#### Empty Dataframe

In [4]:
My_df = pd.DataFrame()
print(My_df)

Empty DataFrame
Columns: []
Index: []

#### 1) Dataframe using list of lists

In [15]:
Personal_data = [['Anil','Father',51,'Graduation','Welder'],['Rema','Mother',50,'Graduation','Home maker'],['Arya','Sister',20,'Graduation pursuing','Student']]
My_df = pd.DataFrame(Personal_data,columns=['Name','Relation','Age','Qualification','Occupation'])
My_df

   Name Relation  Age        Qualification  Occupation
0  Anil   Father   51           Graduation      Welder
1  Rema   Mother   50           Graduation  Home maker
2  Arya   Sister   20  Graduation pursuing     Student

#### 2) Dataframe using dictionaries

In [12]:
Friends_list = {'Friends':['Ayas','Karna','Kiran','Suved'],
'Age':[24,26,25,25],'Pet name':['Kunjava','Hulk','Chakappan','Jose'],'Ambition':['Chartered Accountant','IPS','Actor','Teacher']
}
My_df = pd.DataFrame(Friends_list)
My_df

  Friends  Age   Pet name              Ambition
0    Ayas   24    Kunjava  Chartered Accountant
1   Karna   26       Hulk                   IPS
2   Kiran   25  Chakappan                 Actor
3   Suved   25       Jose               Teacher

#### 3) Dataframe using list of dictionaries

In [18]:
My_favourites = [
{'Name':'Leonardo DiCaprio','Movie':'The Wolf of Wall Street','Oscar recipient':'Yes'},
{'Name':'Tom Cruise','Movie':'Mission Impossible series','Oscar recipient':'No'},
{'Name':'Angelina Jolie','Movie':'Salt','Oscar recipient':'Yes'},
{'Name':'Scarlett Johansson','Movie':'Lucy','Oscar recipient':'No'},
{'Name':'Robert Downey Jr.','Movie':'Iron Man','Oscar recipient':'Yes'},   
{'Name':'Johnny Depp','Movie':'Pirates of Carribean series','Oscar recipient':'Yes'}        
]
My_df = pd.DataFrame(My_favourites)
My_df

                 Name                        Movie Oscar recipient
0   Leonardo DiCaprio      The Wolf of Wall Street             Yes
1          Tom Cruise    Mission Impossible series              No
2      Angelina Jolie                         Salt             Yes
3  Scarlett Johansson                         Lucy              No
4   Robert Downey Jr.                     Iron Man             Yes
5         Johnny Depp  Pirates of Carribean series             Yes

#### 4) Dataframe using list of dictionaries with null items

In [13]:
Fitness_Routine = [
{'Day':'Monday','Focus on':'Chest & Triceps','Sets':3},
{'Day':'Tuesday','Focus on':'Wings & Biceps','Sets':4},
{'Day':'Wednesday','Focus on':'Shoulder & Legs','Sets':5},
{'Day':'Thursday','Focus on':'Chest & Triceps','Sets':3},
{'Day':'Friday','Focus on':'Wings & Biceps','Sets':4},
{'Day':'Saturday','Focus on':'Shoulder & Legs','Sets':5},
{'Day':'Rest day',}
]
My_df = pd.DataFrame(Fitness_Routine)
My_df

         Day         Focus on  Sets
0     Monday  Chest & Triceps   3.0
1    Tuesday   Wings & Biceps   4.0
2  Wednesday  Shoulder & Legs   5.0
3   Thursday  Chest & Triceps   3.0
4     Friday   Wings & Biceps   4.0
5   Saturday  Shoulder & Legs   5.0
6   Rest day              NaN   NaN